In [488]:
import pandas as pd

import dependencies

In [489]:
path_input = dependencies.rootFolder / 'data' / 'raw'
path_output = dependencies.rootFolder / 'data' / 'processed'

In [490]:
df_camiones = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='A:C'
)

In [491]:
df_camiones

   VEHÍCULO   WILAYA modelo
0      CC53    Aaiun   VOLVO
1      CC54    Aaiun   VOLVO
2      CC55    Aaiun   VOLVO
3      CC56    Aaiun   VOLVO
4      CC57    Aaiun   VOLVO
..      ...      ...     ...
79    CR219    Smara     MAN
80    CR223    Smara     MAN
81    CR224    Smara     MAN
82    CR225  Bojador     MAN
83    CR226    Dajla     MAN

[84 rows x 3 columns]

In [111]:
df_wilayas = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='B'    
)

In [112]:
df_wilayas

     WILAYA
0     Aaiun
1     Aaiun
2     Aaiun
3     Aaiun
4     Aaiun
..      ...
79    Smara
80    Smara
81    Smara
82  Bojador
83    Dajla

[84 rows x 1 columns]

In [113]:
df_wilayas["WILAYA"] = df_wilayas["WILAYA"].str.capitalize()

In [114]:
df_wilayas = df_wilayas["WILAYA"].drop_duplicates()

In [115]:
df_wilayas = df_wilayas.replace(["Inst"],["Instituciones"])

In [242]:
df_wilayas = pd.DataFrame(df_wilayas.unique())

AttributeError: 'DataFrame' object has no attribute 'unique'

In [116]:
df_wilayas

0              Aaiun
14    Taller central
15            Auserd
20           Bojador
26             Smara
38     Instituciones
40             Dajla
58     Instituciones
62        Transporte
Name: WILAYA, dtype: object

In [117]:
df_wilayas2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='B',
    skiprows=9   
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [118]:
df_wilayas2.dropna()

      wilaya
0    Bojador
1      Smara
2      Smara
3      Smara
4      Smara
..       ...
929    Aaiun
930    Aaiun
931    Aaiun
932    Dajla
933    Aaiun

[933 rows x 1 columns]

In [119]:
df_wilayas2.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [120]:
df_wilayas2 = df_wilayas2.drop_duplicates().dropna()

In [121]:
df_wilayas2["wilaya"] = df_wilayas2["wilaya"].str.capitalize()

In [122]:
df_wilayas2

             wilaya
0           Bojador
1             Smara
7             Aaiun
28           Auserd
48   Taller central
96            Dajla
103   Instituciones
137      Transporte
207   Instituciones

In [124]:
df_wilayas = pd.merge(df_wilayas, df_wilayas2, how="left", left_on="WILAYA", right_on="wilaya")

In [457]:
df_wilayas = df_wilayas.drop_duplicates()

In [461]:
df_wilayas = df_wilayas.drop(['wilaya'], axis=1)

KeyError: "['wilaya'] not found in axis"

In [462]:
df_wilayas

            WILAYA
0            Aaiun
1   Taller central
2           Auserd
3          Bojador
4            Smara
5    Instituciones
7            Dajla
10      Transporte

In [463]:
df_wilayas.to_csv(path_output / "Wilayas.csv")

In [492]:
df_tagnum = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='M:N',
    skiprows=19
)

In [493]:
df_tagnum

   Unnamed: 12  Unnamed: 13
0         CC53     559915.0
1         CC54     559916.0
2         CC55     559917.0
3         CC56     559918.0
4         CC57     559919.0
..         ...          ...
60         NaN          NaN
61         NaN          NaN
62         NaN          NaN
63         NaN          NaN
64         NaN          NaN

[65 rows x 2 columns]

In [494]:
df_tagnum.columns

Index(['Unnamed: 12', 'Unnamed: 13'], dtype='object')

In [495]:
df_camiones2 = pd.merge(df_camiones, df_tagnum, how='left', left_on="VEHÍCULO", right_on="Unnamed: 12")

In [496]:
df_camiones2

   VEHÍCULO   WILAYA modelo  Unnamed: 12  Unnamed: 13
0      CC53    Aaiun   VOLVO        CC53     559915.0
1      CC54    Aaiun   VOLVO        CC54     559916.0
2      CC55    Aaiun   VOLVO        CC55     559917.0
3      CC56    Aaiun   VOLVO        CC56     559918.0
4      CC57    Aaiun   VOLVO        CC57     559919.0
..      ...      ...     ...         ...          ...
79    CR219    Smara     MAN       CR219     771486.0
80    CR223    Smara     MAN       CR223     771511.0
81    CR224    Smara     MAN       CR224     771512.0
82    CR225  Bojador     MAN       CR225     771513.0
83    CR226    Dajla     MAN       CR226     771514.0

[84 rows x 5 columns]

In [497]:
df_camiones = df_camiones2.drop(['Unnamed: 12'], axis=1)

In [498]:
df_camiones = df_camiones.rename(columns={'Unnamed: 13':'TAG Number'})

In [499]:
df_camiones['TAG Number'] = df_camiones['TAG Number'].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [500]:
df_camiones

   VEHÍCULO   WILAYA modelo   TAG Number
0      CC53    Aaiun   VOLVO    559915.0
1      CC54    Aaiun   VOLVO    559916.0
2      CC55    Aaiun   VOLVO    559917.0
3      CC56    Aaiun   VOLVO    559918.0
4      CC57    Aaiun   VOLVO    559919.0
..      ...      ...     ...         ...
79    CR219    Smara     MAN    771486.0
80    CR223    Smara     MAN    771511.0
81    CR224    Smara     MAN    771512.0
82    CR225  Bojador     MAN    771513.0
83    CR226    Dajla     MAN    771514.0

[84 rows x 4 columns]

In [501]:
df_camiones['VEHÍCULO']=df_camiones['VEHÍCULO'].str.lower()

In [502]:
df_camiones

   VEHÍCULO   WILAYA modelo   TAG Number
0      cc53    Aaiun   VOLVO    559915.0
1      cc54    Aaiun   VOLVO    559916.0
2      cc55    Aaiun   VOLVO    559917.0
3      cc56    Aaiun   VOLVO    559918.0
4      cc57    Aaiun   VOLVO    559919.0
..      ...      ...     ...         ...
79    cr219    Smara     MAN    771486.0
80    cr223    Smara     MAN    771511.0
81    cr224    Smara     MAN    771512.0
82    cr225  Bojador     MAN    771513.0
83    cr226    Dajla     MAN    771514.0

[84 rows x 4 columns]

In [503]:
df_camiones.columns

Index(['VEHÍCULO', 'WILAYA', 'modelo ', 'TAG Number'], dtype='object')

In [504]:
df_camiones['modelo ']=df_camiones.loc[df_camiones['modelo '].notnull(), 'modelo '].str.lower().str.capitalize()

In [505]:
df_camiones

   VEHÍCULO   WILAYA modelo   TAG Number
0      cc53    Aaiun   Volvo    559915.0
1      cc54    Aaiun   Volvo    559916.0
2      cc55    Aaiun   Volvo    559917.0
3      cc56    Aaiun   Volvo    559918.0
4      cc57    Aaiun   Volvo    559919.0
..      ...      ...     ...         ...
79    cr219    Smara     Man    771486.0
80    cr223    Smara     Man    771511.0
81    cr224    Smara     Man    771512.0
82    cr225  Bojador     Man    771513.0
83    cr226    Dajla     Man    771514.0

[84 rows x 4 columns]

In [506]:
df_camiones['TAG Number']=df_camiones.loc[df_camiones['TAG Number'].notnull(), 'TAG Number'].astype(int).astype(str)

In [507]:
df_camiones

   VEHÍCULO   WILAYA modelo  TAG Number
0      cc53    Aaiun   Volvo     559915
1      cc54    Aaiun   Volvo     559916
2      cc55    Aaiun   Volvo     559917
3      cc56    Aaiun   Volvo     559918
4      cc57    Aaiun   Volvo     559919
..      ...      ...     ...        ...
79    cr219    Smara     Man     771486
80    cr223    Smara     Man     771511
81    cr224    Smara     Man     771512
82    cr225  Bojador     Man     771513
83    cr226    Dajla     Man     771514

[84 rows x 4 columns]

In [508]:
df_camiones.to_csv(path_output / "Camiones.csv")

In [509]:
df_mecanicos = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='F:I',
    skiprows=9
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [510]:
df_mecanicos.columns = ["mec1", "mec2", "mec3", "mec4"]

In [511]:
df_mecanicos

       mec1        mec2 mec3 mec4
0       dah         NaN  NaN  NaN
1     jatri  hasan chej  NaN  NaN
2     jatri  hasan chej  NaN  NaN
3     jatri  hasan chej  NaN  NaN
4     jatri  hasan chej  NaN  NaN
...     ...         ...  ...  ...
2977    NaN         NaN  NaN  NaN
2978    NaN         NaN  NaN  NaN
2979    NaN         NaN  NaN  NaN
2980    NaN         NaN  NaN  NaN
2981    NaN         NaN  NaN  NaN

[2982 rows x 4 columns]

In [512]:
df_mecanicos2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='F:I',
    skiprows=5
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [513]:
df_mecanicos2.columns = ["mec1", "mec2", "mec3", "mec4"]

In [514]:
df_mecanicos2

       mec1 mec2 mec3 mec4
0    todos   NaN  NaN  NaN
1    todos   NaN  NaN  NaN
2    todos   NaN  NaN  NaN
3    todos   NaN  NaN  NaN
4    todos   NaN  NaN  NaN
..      ...  ...  ...  ...
679     NaN  NaN  NaN  NaN
680     NaN  NaN  NaN  NaN
681     NaN  NaN  NaN  NaN
682     NaN  NaN  NaN  NaN
683     NaN  NaN  NaN  NaN

[684 rows x 4 columns]

In [515]:
df_mecanicos = pd.concat([df_mecanicos, df_mecanicos2])

In [516]:
df_mecanicos = pd.concat([df_mecanicos["mec1"], df_mecanicos["mec2"], df_mecanicos["mec3"], df_mecanicos["mec4"]]).dropna()

In [517]:
df_mecanicos = df_mecanicos.str.lower()

In [518]:
df_mecanicos = pd.DataFrame(df_mecanicos.unique())

In [519]:
df_mecanicos.columns=["mecanicos"]

In [520]:
df_mecanicos

            mecanicos
0                 dah
1               jatri
2        ahmed andala
3        brahim salem
4        moh abdalahi
5           moh fadel
6                 ali
7              laulad
8           sidi alal
9               txapu
10            brahim
11        jefe taller
12      bal-lal hammu
13             sidati
14      mohamed lamin
15      jatri mohamed
16  ahmed salek andal
17    mec transporte
18   salek logistica
19     mohamed fadel
20              lamni
21              todos
22            mohamed
23              saleh
24               dah
25      baba lebisir
26   mohamed abdalahi
27         hasan chej
28          conductor
29             todos
30             chofer
31               ali
32         sidi alal
33           sid alal
34         dah abidin
35              salek
36             juanjo
37      moha abdalahi
38          salek ali
39   chaibata gailani
40               adah
41       jefe taller
42       mohmed lamin
43            bachir
44      moh abdalahi
45        salek ali

In [521]:
df_mecanicos3 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='I:K',
    skiprows=1
)

In [522]:
df_mecanicos3.dropna(subset=["Taller"])

                Nombre          Taller           Oficio
0                 dah         Boujdour         Mecánico
1                saleh        Boujdour  Asist. Mecánico
2        mohamed lamin           Aused  Asist. Mecánico
3         brahim salem           Aused         Mecánico
4        Bal-lal Hammu           Dajla         Mecánico
5   Ahmed Mohamed Lmin           Dajla  Asist. Mecánico
6    Ahmed salek Andal           Aaiun         Mecánico
7            Salek Ali           Aaiun  Asist. Mecánico
8            moh fadel  taller general              NaN
9                 Adah  taller general              NaN
10                 Ali  taller general              NaN
11    Mohamed Abdalahi  taller general              NaN
12              Laulad  taller general              NaN
13           Sidi Alal  taller general              NaN
14    Chaibata Gailani  taller general              NaN
15       Jatri Mohamed           Smara         Mecánico
16          hasan chej           Smara  Asist. Mecánico
17               todos  taller general              NaN
18     mec transporte      transporte          Mecánico
19           conductor          centro              NaN
20      mohamed fadel   taller general     jefe taller
21               txapu           attsf          tecnico
22              juanjo           attsf              NaN
23             bachir   taller general     jefe almacen
27       baba lebisir    intervencion               NaN

In [523]:
df_mecanicos3 = pd.merge(df_mecanicos, df_mecanicos3, how="left", left_on="mecanicos", right_on="Nombre")

In [524]:
df_mecanicos3

            mecanicos            Nombre          Taller           Oficio
0                 dah               NaN             NaN              NaN
1               jatri               NaN             NaN              NaN
2        ahmed andala               NaN             NaN              NaN
3        brahim salem      brahim salem           Aused         Mecánico
4        moh abdalahi               NaN             NaN              NaN
5           moh fadel         moh fadel  taller general              NaN
6                 ali               NaN             NaN              NaN
7              laulad               NaN             NaN              NaN
8           sidi alal               NaN             NaN              NaN
9               txapu             txapu           attsf          tecnico
10            brahim                NaN             NaN              NaN
11        jefe taller               NaN             NaN              NaN
12      bal-lal hammu               NaN             NaN              NaN
13             sidati               NaN             NaN              NaN
14      mohamed lamin     mohamed lamin           Aused  Asist. Mecánico
15      jatri mohamed               NaN             NaN              NaN
16  ahmed salek andal               NaN             NaN              NaN
17    mec transporte    mec transporte      transporte          Mecánico
18   salek logistica   salek logistica              NaN              NaN
19     mohamed fadel     mohamed fadel   taller general     jefe taller
20              lamni             lamni             NaN              NaN
21              todos             todos  taller general              NaN
22            mohamed           mohamed             NaN              NaN
23              saleh             saleh        Boujdour  Asist. Mecánico
24               dah               dah         Boujdour         Mecánico
25      baba lebisir      baba lebisir    intervencion               NaN
26   mohamed abdalahi               NaN             NaN              NaN
27         hasan chej        hasan chej           Smara  Asist. Mecánico
28          conductor         conductor          centro              NaN
29          conductor         conductor             NaN              NaN
30             todos                NaN             NaN              NaN
31             chofer               NaN             NaN              NaN
32               ali                NaN             NaN              NaN
33         sidi alal                NaN             NaN              NaN
34           sid alal               NaN             NaN              NaN
35         dah abidin               NaN             NaN              NaN
36              salek               NaN             NaN              NaN
37             juanjo            juanjo           attsf              NaN
38      moha abdalahi               NaN             NaN              NaN
39          salek ali               NaN             NaN              NaN
40   chaibata gailani               NaN             NaN              NaN
41               adah               NaN             NaN              NaN
42       jefe taller                NaN             NaN              NaN
43       mohmed lamin               NaN             NaN              NaN
44            bachir            bachir   taller general     jefe almacen
45      moh abdalahi                NaN             NaN              NaN
46        salek ali                 NaN             NaN              NaN

In [525]:
df_mecanicos = df_mecanicos3.drop(['Nombre'], axis=1)

In [526]:
df_mecanicos

            mecanicos          Taller           Oficio
0                 dah             NaN              NaN
1               jatri             NaN              NaN
2        ahmed andala             NaN              NaN
3        brahim salem           Aused         Mecánico
4        moh abdalahi             NaN              NaN
5           moh fadel  taller general              NaN
6                 ali             NaN              NaN
7              laulad             NaN              NaN
8           sidi alal             NaN              NaN
9               txapu           attsf          tecnico
10            brahim              NaN              NaN
11        jefe taller             NaN              NaN
12      bal-lal hammu             NaN              NaN
13             sidati             NaN              NaN
14      mohamed lamin           Aused  Asist. Mecánico
15      jatri mohamed             NaN              NaN
16  ahmed salek andal             NaN              NaN
17    mec transporte      transporte          Mecánico
18   salek logistica              NaN              NaN
19     mohamed fadel   taller general     jefe taller
20              lamni             NaN              NaN
21              todos  taller general              NaN
22            mohamed             NaN              NaN
23              saleh        Boujdour  Asist. Mecánico
24               dah         Boujdour         Mecánico
25      baba lebisir    intervencion               NaN
26   mohamed abdalahi             NaN              NaN
27         hasan chej           Smara  Asist. Mecánico
28          conductor          centro              NaN
29          conductor             NaN              NaN
30             todos              NaN              NaN
31             chofer             NaN              NaN
32               ali              NaN              NaN
33         sidi alal              NaN              NaN
34           sid alal             NaN              NaN
35         dah abidin             NaN              NaN
36              salek             NaN              NaN
37             juanjo           attsf              NaN
38      moha abdalahi             NaN              NaN
39          salek ali             NaN              NaN
40   chaibata gailani             NaN              NaN
41               adah             NaN              NaN
42       jefe taller              NaN              NaN
43       mohmed lamin             NaN              NaN
44            bachir   taller general     jefe almacen
45      moh abdalahi              NaN              NaN
46        salek ali               NaN              NaN

In [542]:
df_mecanicos = df_mecanicos.drop_duplicates(subset='mecanicos')

In [543]:
df_mecanicos["mecanicos"] = df_mecanicos["mecanicos"].str.rstrip().str.lstrip()

C:\Users\DiegoFernandezPradal\AppData\Local\Temp\ipykernel_3296\251632328.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_mecanicos["mecanicos"] = df_mecanicos["mecanicos"].str.rstrip().str.lstrip()

In [544]:
df_mecanicos = df_mecanicos.drop_duplicates(subset='mecanicos')

In [545]:
df_mecanicos

            mecanicos          Taller           Oficio
0                 dah             NaN              NaN
1               jatri             NaN              NaN
2        ahmed andala             NaN              NaN
3        brahim salem           Aused         Mecánico
4        moh abdalahi             NaN              NaN
5           moh fadel  taller general              NaN
6                 ali             NaN              NaN
7              laulad             NaN              NaN
8           sidi alal             NaN              NaN
9               txapu           attsf          tecnico
10             brahim             NaN              NaN
11        jefe taller             NaN              NaN
12      bal-lal hammu             NaN              NaN
13             sidati             NaN              NaN
14      mohamed lamin           Aused  Asist. Mecánico
15      jatri mohamed             NaN              NaN
16  ahmed salek andal             NaN              NaN
17     mec transporte     transporte          Mecánico
18    salek logistica             NaN              NaN
19      mohamed fadel  taller general     jefe taller
20              lamni             NaN              NaN
21              todos  taller general              NaN
22            mohamed             NaN              NaN
23              saleh        Boujdour  Asist. Mecánico
25       baba lebisir   intervencion               NaN
26   mohamed abdalahi             NaN              NaN
27         hasan chej           Smara  Asist. Mecánico
28          conductor          centro              NaN
31             chofer             NaN              NaN
34           sid alal             NaN              NaN
35         dah abidin             NaN              NaN
36              salek             NaN              NaN
37             juanjo           attsf              NaN
38      moha abdalahi             NaN              NaN
39          salek ali             NaN              NaN
40   chaibata gailani             NaN              NaN
41               adah             NaN              NaN
43       mohmed lamin             NaN              NaN
44             bachir  taller general     jefe almacen

In [527]:
df_mecanicos.to_csv(path_output / "Mecanicos.csv")

In [377]:
df_averiaCorr = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='S:AE',
    skiprows=8,
    nrows=1
)

In [378]:
df_averiaCorr

,Averias,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30
0,Chasis,Carrocería,Ruedas,Mecanica,"Elec, vehiculos",Obra civil,Agua y combustible,Herramientas,Informatica,Exteriores,Aire,Maquinaria,elecricidad

In [379]:
df_averiaCorr = df_averiaCorr.transpose()

In [380]:
df_averiaCorr

                              0
Averias                  Chasis
Unnamed: 19          Carrocería
Unnamed: 20              Ruedas
Unnamed: 21            Mecanica
Unnamed: 22     Elec, vehiculos
Unnamed: 23          Obra civil
Unnamed: 24  Agua y combustible
Unnamed: 25        Herramientas
Unnamed: 26         Informatica
Unnamed: 27          Exteriores
Unnamed: 28                Aire
Unnamed: 29          Maquinaria
Unnamed: 30         elecricidad

In [381]:
df_averiaCorr.columns = ["Averia"]

In [382]:
df_averiaCorr_lista = df_averiaCorr["Averia"].tolist()

In [383]:
df_averiaCorr_lista

['Chasis',
 'Carrocería',
 'Ruedas',
 'Mecanica',
 'Elec, vehiculos',
 'Obra civil',
 'Agua y combustible',
 'Herramientas',
 'Informatica',
 'Exteriores',
 'Aire',
 'Maquinaria',
 'elecricidad']

In [384]:
df_averiaCorr = pd.DataFrame(df_averiaCorr, columns = ['Averia'])

In [385]:
df_averiaCorr

                         Averia
Averias                  Chasis
Unnamed: 19          Carrocería
Unnamed: 20              Ruedas
Unnamed: 21            Mecanica
Unnamed: 22     Elec, vehiculos
Unnamed: 23          Obra civil
Unnamed: 24  Agua y combustible
Unnamed: 25        Herramientas
Unnamed: 26         Informatica
Unnamed: 27          Exteriores
Unnamed: 28                Aire
Unnamed: 29          Maquinaria
Unnamed: 30         elecricidad

In [466]:
df_averiaCorr["Averia"] = df_averiaCorr["Averia"].str.capitalize()

In [467]:
df_averiaCorr

                         Averia
Averias                  Chasis
Unnamed: 19          Carrocería
Unnamed: 20              Ruedas
Unnamed: 21            Mecanica
Unnamed: 22     Elec, vehiculos
Unnamed: 23          Obra civil
Unnamed: 24  Agua y combustible
Unnamed: 25        Herramientas
Unnamed: 26         Informatica
Unnamed: 27          Exteriores
Unnamed: 28                Aire
Unnamed: 29          Maquinaria
Unnamed: 30         Elecricidad

In [468]:
df_averiaCorr.to_csv(path_output / "Averia.csv")

In [244]:
df_taller = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='G:H',
    skiprows=48
)

In [245]:
df_taller.columns=["tipo taller", "taller"]

In [246]:
df_taller = df_taller.dropna()

In [247]:
df_taller

  tipo taller          taller
0          TR           Aaiun
1          TR           Smara
2          TR          Auserd
3          TR           Dajla
4          TR         Bojador
5         ATC   Instituciones
6         ATC  taller central

In [469]:
df_taller["taller"] = df_taller["taller"].str.capitalize()

In [470]:
df_taller

  tipo taller          taller
0          TR           Aaiun
1          TR           Smara
2          TR          Auserd
3          TR           Dajla
4          TR         Bojador
5         ATC   Instituciones
6         ATC  Taller central

In [471]:
df_taller.to_csv(path_output / "Taller.csv")

In [147]:
df_tipomant = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='Lista de camiones',
    usecols='M',
    skiprows=1,
    nrows= 18
)

In [148]:
df_tipomant = df_tipomant.dropna()

In [149]:
df_tipomant

     Tipos mantto
0           Anual
1       Semestral
2         Mensual
3         Semanal
4  Cuatrimestral

In [150]:
df_tipomant2 = pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='preventive BBDD',
    usecols='D',
    skiprows=5
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [151]:
df_tipomant2 = df_tipomant2.dropna()

In [152]:
df_tipomant2

    Clase de Mantenimiento
0               semestral
1               semestral
2               semestral
3           Cuatrimestral
4           Cuatrimestral
..                     ...
489                Mensual
490                Mensual
491                Mensual
492                Mensual
493                Mensual

[494 rows x 1 columns]

In [44]:
df_tipomant2["Clase de Mantenimiento"] = df_tipomant2["Clase de Mantenimiento"].str.capitalize()

In [153]:
df_tipomant2

    Clase de Mantenimiento
0               semestral
1               semestral
2               semestral
3           Cuatrimestral
4           Cuatrimestral
..                     ...
489                Mensual
490                Mensual
491                Mensual
492                Mensual
493                Mensual

[494 rows x 1 columns]

In [154]:
df_tipomant2 = df_tipomant2["Clase de Mantenimiento"].drop_duplicates()

In [155]:
df_tipomant2

0          semestral
3      Cuatrimestral
7             mensual
54          Semestral
58            Mensual
102             Anual
329         semestral
Name: Clase de Mantenimiento, dtype: object

In [156]:
df_tipomant = pd.merge(df_tipomant, df_tipomant2, how="left", left_on="Tipos mantto", right_on="Clase de Mantenimiento")

In [157]:
df_tipomant

     Tipos mantto Clase de Mantenimiento
0           Anual                  Anual
1       Semestral              Semestral
2         Mensual                Mensual
3         Semanal                    NaN
4  Cuatrimestral          Cuatrimestral

In [158]:
df_tipomant = pd.concat([df_tipomant["Tipos mantto"], df_tipomant["Clase de Mantenimiento"]]).dropna()

In [159]:
df_tipomant

0             Anual
1         Semestral
2           Mensual
3           Semanal
4    Cuatrimestral
0             Anual
1         Semestral
2           Mensual
4    Cuatrimestral
dtype: object

In [160]:
df_tipomant = df_tipomant.unique().tolist()

In [161]:
df_tipomant

['Anual', 'Semestral', 'Mensual', 'Semanal', 'Cuatrimestral ']

In [162]:
df_tipomant = pd.DataFrame(df_tipomant, columns = ['Tipo mantenimiento'])

In [472]:
df_tipomant

  Tipo mantenimiento
0              Anual
1          Semestral
2            Mensual
3            Semanal
4     Cuatrimestral

In [473]:
df_tipomant.to_csv(path_output / "Tipomant.csv")

In [1]:
df_OTCmecanicos= pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='D, F:I',
    skiprows=9
)

NameError: name 'pd' is not defined

In [529]:
df_OTCmecanicos

       NºOTC Nombre1     Nombre2 Nombre3 Nombre4
0     1846.0     dah         NaN     NaN     NaN
1     1847.0   jatri  hasan chej     NaN     NaN
2     1848.0   jatri  hasan chej     NaN     NaN
3     1849.0   jatri  hasan chej     NaN     NaN
4     1850.0   jatri  hasan chej     NaN     NaN
...      ...     ...         ...     ...     ...
2977     NaN     NaN         NaN     NaN     NaN
2978     NaN     NaN         NaN     NaN     NaN
2979     NaN     NaN         NaN     NaN     NaN
2980     1.0     NaN         NaN     NaN     NaN
2981     1.0     NaN         NaN     NaN     NaN

[2982 rows x 5 columns]

In [530]:
df_OTCmecanicos = pd.melt(df_OTCmecanicos, id_vars='NºOTC', value_vars=['Nombre1', 'Nombre2', 'Nombre3', 'Nombre4'])

In [531]:
df_OTCmecanicos = df_OTCmecanicos.dropna(subset='value')

In [532]:
df_OTCmecanicos = df_OTCmecanicos.sort_values(by='NºOTC')

In [533]:
df_OTCmecanicos

       NºOTC variable              value
0     1846.0  Nombre1                dah
2983  1847.0  Nombre2         hasan chej
1     1847.0  Nombre1              jatri
2     1848.0  Nombre1              jatri
2984  1848.0  Nombre2         hasan chej
...      ...      ...                ...
3914  2784.0  Nombre2                ali
6896  2784.0  Nombre3             Laulad
9878  2784.0  Nombre4          sidi alal
3915  2785.0  Nombre2          Salek Ali
933   2785.0  Nombre1  Ahmed salek Andal

[1655 rows x 3 columns]

In [534]:
df_OTCmecanicos = df_OTCmecanicos[['NºOTC', 'value']]

In [535]:
df_OTCmecanicos

       NºOTC              value
0     1846.0                dah
2983  1847.0         hasan chej
1     1847.0              jatri
2     1848.0              jatri
2984  1848.0         hasan chej
...      ...                ...
3914  2784.0                ali
6896  2784.0             Laulad
9878  2784.0          sidi alal
3915  2785.0          Salek Ali
933   2785.0  Ahmed salek Andal

[1655 rows x 2 columns]

In [536]:
df_OTCmecanicos['value']=df_OTCmecanicos['value'].str.lower()

C:\Users\DiegoFernandezPradal\AppData\Local\Temp\ipykernel_3296\3558458202.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_OTCmecanicos['value']=df_OTCmecanicos['value'].str.lower()

In [537]:
df_OTCmecanicos['NºOTC']=df_OTCmecanicos['NºOTC'].astype(int).astype(str)

C:\Users\DiegoFernandezPradal\AppData\Local\Temp\ipykernel_3296\837359237.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_OTCmecanicos['NºOTC']=df_OTCmecanicos['NºOTC'].astype(int).astype(str)

In [538]:
df_OTCmecanicos

     NºOTC              value
0     1846                dah
2983  1847         hasan chej
1     1847              jatri
2     1848              jatri
2984  1848         hasan chej
...    ...                ...
3914  2784                ali
6896  2784             laulad
9878  2784          sidi alal
3915  2785          salek ali
933   2785  ahmed salek andal

[1655 rows x 2 columns]

In [539]:
df_OTCmecanicos.to_csv(path_output / "OTCmecanicos.csv")

In [328]:
df_OTCaverias= pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='D, S:AE',
    skiprows=9
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [339]:
df_OTCaverias

,NºOTC,Chasis,Carrocería,Ruedas,Mecanica,"Elec, vehiculos",Obra civil,Agua y combustible,Herramientas,Informatica,Exteriores,Aire,Maquinaria,elecricidad
0,1846.0,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1847.0,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1848.0,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1849.0,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1850.0,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2977,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2978,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2979,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2980,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2981,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [387]:
df_OTCaverias = pd.melt(df_OTCaverias, id_vars='NºOTC', value_vars=df_averiaCorr_lista)

In [388]:
df_OTCaverias

        NºOTC     variable value
0      1846.0       Chasis   NaN
1      1847.0       Chasis   NaN
2      1848.0       Chasis   NaN
3      1849.0       Chasis   NaN
4      1850.0       Chasis   NaN
...       ...          ...   ...
38761     NaN  elecricidad   NaN
38762     NaN  elecricidad   NaN
38763     NaN  elecricidad   NaN
38764     1.0  elecricidad   NaN
38765     1.0  elecricidad   NaN

[38766 rows x 3 columns]

In [389]:
df_OTCaverias = df_OTCaverias.dropna(subset='value')

In [390]:
df_OTCaverias

        NºOTC     variable value
5      1851.0       Chasis     1
6      1852.0       Chasis     1
9      1855.0       Chasis     1
13     1859.0       Chasis     1
15     1861.0       Chasis     1
...       ...          ...   ...
35851  1913.0  elecricidad   1.0
35877  1939.0  elecricidad   1.0
35888  1950.0  elecricidad   1.0
35905  1967.0  elecricidad   1.0
36046  2108.0  elecricidad   1.0

[963 rows x 3 columns]

In [391]:
df_OTCaverias = df_OTCaverias.sort_values(by='NºOTC')

In [392]:
df_OTCaverias

        NºOTC         variable value
8946   1846.0         Mecanica   1.0
5965   1847.0           Ruedas   1.0
5966   1848.0           Ruedas   1.0
2985   1849.0       Carrocería   1.0
5968   1850.0           Ruedas   1.0
...       ...              ...   ...
12858  2782.0  Elec, vehiculos   1.0
9877   2783.0         Mecanica   1.0
9878   2784.0         Mecanica   1.0
932    2784.0           Chasis     1
933    2785.0           Chasis     1

[963 rows x 3 columns]

In [393]:
df_OTCaverias = df_OTCaverias.drop(['value'], axis=1)

In [394]:
df_OTCaverias

        NºOTC         variable
8946   1846.0         Mecanica
5965   1847.0           Ruedas
5966   1848.0           Ruedas
2985   1849.0       Carrocería
5968   1850.0           Ruedas
...       ...              ...
12858  2782.0  Elec, vehiculos
9877   2783.0         Mecanica
9878   2784.0         Mecanica
932    2784.0           Chasis
933    2785.0           Chasis

[963 rows x 2 columns]

In [419]:
df_OTCaverias['NºOTC'].astype(int).astype(str)

8946     1846
5965     1847
5966     1848
2985     1849
5968     1850
         ...
12858    2782
9877     2783
9878     2784
932      2784
933      2785
Name: NºOTC, Length: 963, dtype: object

In [421]:
df_OTCaverias['NºOTC']=df_OTCaverias['NºOTC'].astype(int).astype(str)

In [450]:
df_OTCaverias

      NºOTC         variable
8946   1846         Mecanica
5965   1847           Ruedas
5966   1848           Ruedas
2985   1849       Carrocería
5968   1850           Ruedas
...     ...              ...
12858  2782  Elec, vehiculos
9877   2783         Mecanica
9878   2784         Mecanica
932    2784           Chasis
933    2785           Chasis

[963 rows x 2 columns]

In [451]:
df_OTCaverias.to_csv(path_output / "OTCaverias.csv")

In [404]:
df_OTs= pd.read_excel(
    path_input / 'BASE DE DATOS 2022 PRUEBA.xlsx',
    sheet_name='BaseDatosCorrectiva 2022',
    usecols='A:E, J, L, AF, AG',
    skiprows=9
)

c:\Users\DiegoFernandezPradal\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [405]:
df_OTs

,Nº,wilaya,Tall/Rep,NºOTC,Solicitado,Fecha,Fecha Fin,Descripción trabajo solicitado,Descripción trabajo realizado
0,cc62,Bojador,ATC,1846.0,cheibata,2022-01-03 00:00:00,2022-01-04 00:00:00,problema en los cambios,se ha cambiado la palanca
1,cc77,Smara,TR,1847.0,chofer,2022-01-04 00:00:00,2022-01-05 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo
2,cc05,Smara,TR,1848.0,chofer,2022-01-09 00:00:00,2022-01-10 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo
3,cc08,Smara,TR,1849.0,chofer,2022-01-09 00:00:00,2022-01-09 00:00:00,rutura en las rempo olas,se han soldado las rompo olas de la cisterna
4,cc08,Smara,TR,1850.0,chofer,2022-01-06 00:00:00,2022-01-06 00:00:00,neumatico deteriorado,se ha cambiado el neumatico por uno nuevo
...,...,...,...,...,...,...,...,...,...
2977,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2978,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2979,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2980,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN
2981,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN

In [408]:
df_OTs = df_OTs.dropna(subset='NºOTC')

In [403]:
df_OTs

,Nº,wilaya,Tall/Rep,NºOTC,Fecha,Fecha Fin,Descripción trabajo solicitado,Descripción trabajo realizado
0,cc62,Bojador,ATC,1846.0,2022-01-03 00:00:00,2022-01-04 00:00:00,problema en los cambios,se ha cambiado la palanca
1,cc77,Smara,TR,1847.0,2022-01-04 00:00:00,2022-01-05 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo
2,cc05,Smara,TR,1848.0,2022-01-09 00:00:00,2022-01-10 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo
3,cc08,Smara,TR,1849.0,2022-01-09 00:00:00,2022-01-09 00:00:00,rutura en las rempo olas,se han soldado las rompo olas de la cisterna
4,cc08,Smara,TR,1850.0,2022-01-06 00:00:00,2022-01-06 00:00:00,neumatico deteriorado,se ha cambiado el neumatico por uno nuevo
...,...,...,...,...,...,...,...,...
1208,NaN,NaN,NaN,3060.0,NaN,NaN,NaN,NaN
1209,NaN,NaN,NaN,3061.0,NaN,NaN,NaN,NaN
1210,NaN,NaN,NaN,3062.0,NaN,NaN,NaN,NaN
2980,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN
2981,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN

In [409]:
df_OTs['Tipo OT']='OTC'

C:\Users\DiegoFernandezPradal\AppData\Local\Temp\ipykernel_3296\1522437673.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_OTs['Tipo OT']='OTC'

In [410]:
df_OTs

,Nº,wilaya,Tall/Rep,NºOTC,Solicitado,Fecha,Fecha Fin,Descripción trabajo solicitado,Descripción trabajo realizado,Tipo OT
0,cc62,Bojador,ATC,1846.0,cheibata,2022-01-03 00:00:00,2022-01-04 00:00:00,problema en los cambios,se ha cambiado la palanca,OTC
1,cc77,Smara,TR,1847.0,chofer,2022-01-04 00:00:00,2022-01-05 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo,OTC
2,cc05,Smara,TR,1848.0,chofer,2022-01-09 00:00:00,2022-01-10 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo,OTC
3,cc08,Smara,TR,1849.0,chofer,2022-01-09 00:00:00,2022-01-09 00:00:00,rutura en las rempo olas,se han soldado las rompo olas de la cisterna,OTC
4,cc08,Smara,TR,1850.0,chofer,2022-01-06 00:00:00,2022-01-06 00:00:00,neumatico deteriorado,se ha cambiado el neumatico por uno nuevo,OTC
...,...,...,...,...,...,...,...,...,...,...
1208,NaN,NaN,NaN,3060.0,NaN,NaN,NaN,NaN,NaN,OTC
1209,NaN,NaN,NaN,3061.0,NaN,NaN,NaN,NaN,NaN,OTC
1210,NaN,NaN,NaN,3062.0,NaN,NaN,NaN,NaN,NaN,OTC
2980,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,OTC
2981,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,OTC

In [411]:
df_OTs = df_OTs.dropna(subset='Nº')

In [412]:
df_OTs

,Nº,wilaya,Tall/Rep,NºOTC,Solicitado,Fecha,Fecha Fin,Descripción trabajo solicitado,Descripción trabajo realizado,Tipo OT
0,cc62,Bojador,ATC,1846.0,cheibata,2022-01-03 00:00:00,2022-01-04 00:00:00,problema en los cambios,se ha cambiado la palanca,OTC
1,cc77,Smara,TR,1847.0,chofer,2022-01-04 00:00:00,2022-01-05 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo,OTC
2,cc05,Smara,TR,1848.0,chofer,2022-01-09 00:00:00,2022-01-10 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo,OTC
3,cc08,Smara,TR,1849.0,chofer,2022-01-09 00:00:00,2022-01-09 00:00:00,rutura en las rempo olas,se han soldado las rompo olas de la cisterna,OTC
4,cc08,Smara,TR,1850.0,chofer,2022-01-06 00:00:00,2022-01-06 00:00:00,neumatico deteriorado,se ha cambiado el neumatico por uno nuevo,OTC
...,...,...,...,...,...,...,...,...,...,...
929,cc53,Aaiun,ATC,2781.0,jefe taller,25//09/2022,2022-09-25 00:00:00,travesaño roto +5era 6da hoja de la ballesta t...,se ha cambiado el trabesaño por uno nuevo + 5e...,OTC
930,cc53,Aaiun,ATC,2782.0,jefe taller,2022-09-25 00:00:00,2022-09-25 00:00:00,problema en el sistema electrico,se ha cambiado el volvula de corta corriente p...,OTC
931,cc53,Aaiun,ATC,2783.0,jefe taller,2022-09-21 00:00:00,2022-09-23 00:00:00,problema el la mas y disco embrague,se ha cambiado la masa y el disco embrague por...,OTC
932,cc68,Dajla,ATC,2784.0,jefe taller coordi,2022-09-19 00:00:00,2022-09-22 00:00:00,amortiguadores rotas + esparragos + bomba hidr...,se han cambiado los 2 amortiguadores traseros ...,OTC
933,cc78,Aaiun,TR,2785.0,conductor,2022-09-29 00:00:00,2022-09-29 00:00:00,ballesta delantera rota curva,se ha cambiado la ballesta delantera por una n...,OTC

In [453]:
df_OTs['NºOTC']=df_OTs['NºOTC'].astype(int).astype(str)

C:\Users\DiegoFernandezPradal\AppData\Local\Temp\ipykernel_3296\543536861.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_OTs['NºOTC']=df_OTs['NºOTC'].astype(int).astype(str)

In [455]:
df_OTs

,Nº,wilaya,Tall/Rep,NºOTC,Solicitado,Fecha,Fecha Fin,Descripción trabajo solicitado,Descripción trabajo realizado,Tipo OT
0,cc62,Bojador,ATC,1846,cheibata,2022-01-03 00:00:00,2022-01-04 00:00:00,problema en los cambios,se ha cambiado la palanca,OTC
1,cc77,Smara,TR,1847,chofer,2022-01-04 00:00:00,2022-01-05 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo,OTC
2,cc05,Smara,TR,1848,chofer,2022-01-09 00:00:00,2022-01-10 00:00:00,neumatico en mal estado,se ha cambiado el neumatico por uno nuevo,OTC
3,cc08,Smara,TR,1849,chofer,2022-01-09 00:00:00,2022-01-09 00:00:00,rutura en las rempo olas,se han soldado las rompo olas de la cisterna,OTC
4,cc08,Smara,TR,1850,chofer,2022-01-06 00:00:00,2022-01-06 00:00:00,neumatico deteriorado,se ha cambiado el neumatico por uno nuevo,OTC
...,...,...,...,...,...,...,...,...,...,...
929,cc53,Aaiun,ATC,2781,jefe taller,25//09/2022,2022-09-25 00:00:00,travesaño roto +5era 6da hoja de la ballesta t...,se ha cambiado el trabesaño por uno nuevo + 5e...,OTC
930,cc53,Aaiun,ATC,2782,jefe taller,2022-09-25 00:00:00,2022-09-25 00:00:00,problema en el sistema electrico,se ha cambiado el volvula de corta corriente p...,OTC
931,cc53,Aaiun,ATC,2783,jefe taller,2022-09-21 00:00:00,2022-09-23 00:00:00,problema el la mas y disco embrague,se ha cambiado la masa y el disco embrague por...,OTC
932,cc68,Dajla,ATC,2784,jefe taller coordi,2022-09-19 00:00:00,2022-09-22 00:00:00,amortiguadores rotas + esparragos + bomba hidr...,se han cambiado los 2 amortiguadores traseros ...,OTC
933,cc78,Aaiun,TR,2785,conductor,2022-09-29 00:00:00,2022-09-29 00:00:00,ballesta delantera rota curva,se ha cambiado la ballesta delantera por una n...,OTC

In [454]:
df_OTs.to_csv(path_output / "OTs.csv")